10/data/attachments/e58817b4430f1e69.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>William_image_Friend_75908_0</nif:username>
            <nif:friendToBeRequested>soap_friends_e640d8d4-cc95-4499-a45e-95bdf4047d43</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>